Catalogs/ХранилищеШаблонов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ХранилищеШаблонов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>XMLОписаниеМакета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерМакета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоляШаблона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаркированнаяПродукция</Name>
					<Comment>используется для этикеток маркированной продукции</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьРамки</Name>
					<Comment>для маркированной продукции</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Поля</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЗаполнения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>9</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПоУмолчанию</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формат</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ХранилищеШаблонов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	
	Методы.Вставить("ЗаполнитьПредопределенныеЭлементы");
	Методы.Вставить("УстановитьПризнакВыводитьРамки");
	
КонецПроцедуры

Процедура ЗаполнитьПредопределенныеЭлементы() Экспорт
	Макет = Справочники.ХранилищеШаблонов.ПолучитьМакет("ШаблоныЭтикеток");
	НомерСтроки = 1;
	
	ИмяПредопределенного = Макет.Область(НомерСтроки, 1, НомерСтроки, 1).Текст;
	
	Пока  ИмяПредопределенного <> "" Цикл
		
		ШаблонСсылка = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ХранилищеШаблонов."+ИмяПредопределенного);
		Если ШаблонСсылка <> Неопределено 
			И НЕ ЗначениеЗаполнено(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ШаблонСсылка, "XMLОписаниеМакета")) Тогда
			
			ШаблонОбъект = ШаблонСсылка.ПолучитьОбъект();
			
			ШаблонОбъект.XMLОписаниеМакета      = Макет.Область(НомерСтроки, 2, НомерСтроки, 2).Текст;
			ШаблонОбъект.РазмерМакета           = Макет.Область(НомерСтроки, 3, НомерСтроки, 3).Текст;
			ШаблонОбъект.МаркированнаяПродукция = (Макет.Область(НомерСтроки, 4, НомерСтроки, 4).Текст = "1");
			ШаблонОбъект.ВыводитьРамки          = Истина;
			ШаблонОбъект.ПоляШаблона            = "ПоляШаблонаНоменклатура";
			
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ШаблонОбъект);
		КонецЕсли; 
		
		НомерСтроки = НомерСтроки + 1;
		ИмяПредопределенного = Макет.Область(НомерСтроки, 1, НомерСтроки, 1).Текст;
	КонецЦикла;
	
КонецПроцедуры

Функция ПараметрыШаблонаЭтикеток(Знач ШаблонЭтикетки) Экспорт
	Результат = Новый Структура;
	Результат.Вставить("Наименование");
	Результат.Вставить("АдресХранилищаСКД");
	Результат.Вставить("XMLОписаниеМакета");
	Результат.Вставить("ВыводитьРамки", Истина);
	
	РеквизитыОбъекта = Новый Структура("Наименование, ПоляШаблона, XMLОписаниеМакета, ВыводитьРамки");
	
	Если ТипЗнч(ШаблонЭтикетки) = Тип("СправочникОбъект.ХранилищеШаблонов") Тогда
		ЗаполнитьЗначенияСвойств(РеквизитыОбъекта, ШаблонЭтикетки);
	Иначе
		Если ТипЗнч(ШаблонЭтикетки) = Тип("Строка") Тогда
			ШаблонЭтикетки = "Справочник.ХранилищеШаблонов."+ШаблонЭтикетки;
		КонецЕсли; 
		
		РеквизитыОбъекта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ШаблонЭтикетки, РеквизитыОбъекта);
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(РеквизитыОбъекта.ПоляШаблона) Тогда
		Возврат Результат;
	КонецЕсли; 
	
	МакетПоляШаблона = Справочники.ХранилищеШаблонов.ПолучитьМакет(РеквизитыОбъекта.ПоляШаблона);
	
	Результат.Вставить("Наименование",      РеквизитыОбъекта.Наименование);
	Результат.Вставить("АдресХранилищаСКД", ПоместитьВоВременноеХранилище(МакетПоляШаблона, Новый УникальныйИдентификатор));
	Результат.Вставить("XMLОписаниеМакета", РеквизитыОбъекта.XMLОписаниеМакета);
	Результат.Вставить("ВыводитьРамки",     РеквизитыОбъекта.ВыводитьРамки);
	
	Возврат Результат;
КонецФункции 

#КонецОбласти 

#Область ОбработчикиОбновления

Процедура УстановитьПризнакВыводитьРамки() Экспорт
	СправочникВыборка = Справочники.ХранилищеШаблонов.Выбрать();
	
	Пока СправочникВыборка.Следующий() Цикл
		Объект = СправочникВыборка.ПолучитьОбъект();
		Если Объект = Неопределено Тогда
			Продолжить;
		КонецЕсли; 
		
		Объект.ВыводитьРамки = Истина;
		
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Объект);
	КонецЦикла; 
КонецПроцедуры
 
#КонецОбласти 


#КонецЕсли
